Tekla Open API Reference for Tekla Structures 2025
UserPropertyOption Class
 The UserPropertyOption class contains the properties of a user property value option.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Catalogs.UserPropertyOption
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class UserPropertyOption
Public NotInheritable Class UserPropertyOption
The UserPropertyOption type exposes the following members.
Constructors
Name | Description
UserPropertyOption
Initializes a new instance of the UserPropertyOption class
Top
Properties
Name | Description
DoubleValue
 The double value.
IntValue
 The integer value.
OptionLabel
 The option name.
OptionLabelTranslated
 The translated option name.
StringValue
 The string value.
Top
See Also
Reference
Tekla.Structures.Catalogs Namespace